LibraryManagementSystem/app/views/libraries/_form.html.erb

    <%= form.label :university_id %>
    <%= select("library", "university_id", University.all.reject{|u| u.name == "default"}.collect{ |c| [ c.name, c.id] })  %>
---
SELECT "universities".* FROM "universities"