LibraryManagementSystem/app/views/libraries/index.html.erb

  <tbody>
    <% @university.libraries.each do |library| %>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ?  [["university_id", 3]]