LibraryManagementSystem/app/views/libraries/index.html.erb

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr align ="center">
<!--        <td><%#= University.find(library.university_id).name %></td>-->