LibraryManagementSystem/app/views/libraries/show.html.erb

  <strong>University:</strong>
  <%= University.find(@library.university_id).name %>
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]