LibraryManagementSystem/app/views/reservations/_form2.html.erb

SELECT "lib_books".* FROM "lib_books" WHERE "lib_books"."library_id" = ?  [["library_id", 2]]
---
    <%= form.label :book_id %>
    <%= select("reservations", "lib_book_id", @library.lib_books.collect{ |c| [ Book.find(c.book_id).title, c.id] })  %>