LibraryManagementSystem/app/views/reservations/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% if current_user.usertype == "admin" || current_user.usertype == "librarian"
          @user = User.find_by_id(reservation.user_id)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% end %>
        <td><%= Book.find_by_id(reservation.lib_book.book_id).title %></td>