LibraryManagementSystem/app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    if params[:search]
      @books = []
      Book.all.each do |book|

INSERT INTO "books" ("created_at", "updated_at", "title", "language", "published", "edition", "image", "subject", "summary", "is_special_collection_item", "author", "isbn") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "isbn" = ?, "title" = ?, "author" = ?, "language" = ?, "published" = ?, "edition" = ?, "image" = ?, "subject" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    respond_to do |format|
      if @book.update(book_params)