LibraryManagementSystem/app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = Bookmark.all
---
SELECT "bookmarks".* FROM "bookmarks" WHERE (user_id = 1)

  def create
    @bookmark = Bookmark.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save
---
INSERT INTO "bookmarks" ("user_id", "lib_book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["lib_book_id", 1], ["created_at", "2019-10-01 04:35:22.346860"], ["updated_at", "2019-10-01 04:35:22.346860"]]

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 5]]

    def get_library
      @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def get_university
      @university = University.find(params[:university_id])
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_bookmark
      @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]