LibraryManagementSystem/app/controllers/lib_books_controller.rb

SELECT "lib_books".* FROM "lib_books" WHERE "lib_books"."library_id" = ?  [["library_id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "lib_books" WHERE "lib_books"."book_id" = ? AND "lib_books"."library_id" = ? LIMIT ?  [["book_id", 1], ["library_id", 2], ["LIMIT", 1]]
INSERT INTO "lib_books" ("library_id", "book_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["library_id", 2], ["book_id", 1], ["quantity", 3], ["created_at", "2019-09-27 20:18:38.207482"], ["updated_at", "2019-09-27 20:18:38.207482"]]
---
  def index
    if params[:search]
      @lib_books = []
      @library.lib_books.each do |lib_book|
        @book = Book.find_by_id(lib_book.book_id)
        if params[:title] != ""
          next if !@book.title.downcase.include? params[:title].downcase
        end
        if params[:author] != ""
          next if !@book.author.downcase.include? params[:author].downcase
        end
        if params[:published] != ""
          next if !@book.published.to_s.eql? params[:published]
        end
        if params[:subject] != ""
          next if !@book.subject.downcase.include? params[:subject].downcase
        end
        @lib_books.push(lib_book)

INSERT INTO "lib_books" ("library_id", "book_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["library_id", 1], ["book_id", 1], ["quantity", 3], ["created_at", "2019-09-29 19:54:33.594138"], ["updated_at", "2019-09-29 19:54:33.594138"]]
---
  def create
    @lib_book = LibBook.new(lib_book_params)

    respond_to do |format|
      if @lib_book.save

UPDATE "lib_books" SET "quantity" = ?, "updated_at" = ? WHERE "lib_books"."id" = ?  [["quantity", 5], ["updated_at", "2019-09-27 20:21:28.640184"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @lib_book.update(lib_book_params)

DELETE FROM "lib_books" WHERE "lib_books"."id" = ?  [["id", 1]]
---
  def destroy
    @lib_book.destroy

SELECT  "lib_books".* FROM "lib_books" WHERE "lib_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lib_book
      @lib_book = LibBook.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_library
      @library = Library.find(params[:library_id])

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_university
      @university = University.find(params[:university_id])