LibraryManagementSystem/app/controllers/lib_books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lib_book
      @lib_book = LibBook.find(params[:id])