LibraryManagementSystem/app/controllers/lib_books_controller.rb

UPDATE "lib_books" SET "quantity" = ?, "updated_at" = ? WHERE "lib_books"."id" = ?  [["quantity", 5], ["updated_at", "2019-09-27 20:21:28.640184"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @lib_book.update(lib_book_params)

SELECT  "lib_books".* FROM "lib_books" WHERE "lib_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lib_book
      @lib_book = LibBook.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_library
      @library = Library.find(params[:library_id])