LibraryManagementSystem/app/controllers/libraries_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries"
---
  def index
    if(User.find(current_user.id).user_type == 1)
      @libraries = Library.all