LibraryManagementSystem/app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("university_id", "location", "name", "max_days", "created_at", "updated_at", "fine") VALUES (?, ?, ?, ?, ?, ?, ?)  [["university_id", 6], ["location", "newLocation"], ["name", "newLibrary"], ["max_days", 3], ["created_at", "2019-10-03 05:07:24.059121"], ["updated_at", "2019-10-03 05:07:24.059121"], ["fine", 1]]
---
  def create
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save

UPDATE "libraries" SET "name" = ?, "university" = ?, "location" = ?, "updated_at" = ? WHERE "libraries"."id" = ?  [["name", "library1"], ["university", "universiy1"], ["location", "location1"], ["updated_at", "2019-09-28 02:41:43.328719"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @library.update(library_params)

DELETE FROM "libraries" WHERE "libraries"."id" = ?  [["id", 1]]
---
  def destroy
    @library.destroy

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_university
      @university = University.find(params[:university_id])