LibraryManagementSystem/app/controllers/reservations_controller.rb

  def index
    @reservations = []
    @library.lib_books.each do |lib_book|
      lib_book.reservations.each do |reservation|
---
SELECT "lib_books".* FROM "lib_books" WHERE "lib_books"."library_id" = ?  [["library_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."lib_book_id" = ?  [["lib_book_id", 1]]

  def create
    @reservation = Reservation.new(reservation_params)
    @reservation.checkoutstamp = Time.now()
    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("lib_book_id", "user_id", "status", "checkoutstamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["lib_book_id", 1], ["user_id", 2], ["status", 1], ["checkoutstamp", "2019-09-30 01:50:47.407776"], ["created_at", "2019-09-30 01:50:47.414571"], ["updated_at", "2019-09-30 01:50:47.414571"]]

  def update
    respond_to do |format|
      if @reservation.update(reservation_params)
---
UPDATE "reservations" SET "status" = ?, "returnstamp" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", 0], ["returnstamp", "2019-10-01 03:23:44"], ["updated_at", "2019-10-01 03:23:46.755749"], ["id", 1]]

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def get_library
      @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def get_university
      @university = University.find(params[:university_id])
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]