LibraryManagementSystem/app/controllers/reservations_controller.rb

    def get_library
      @library = Library.find(params[:library_id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def get_university
      @university = University.find(params[:university_id])
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def notify_next
      #Only if book is returned
      if reservation_params[:status].eql?"0"
        @next_requester_query = Reservation.where(:status => 2).where(:lib_book => reservation_params[:lib_book_id]).order(:requeststamp)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."status" = ? AND "reservations"."lib_book_id" = ? ORDER BY "reservations"."requeststamp" ASC LIMIT ?  [["status", 2], ["lib_book_id", 1], ["LIMIT", 1]]