LibraryManagementSystem/app/controllers/universities_controller.rb

SELECT "universities".* FROM "universities"
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user.usertype == "admin"
      @universities = University.all
    else
      @universities = University.where("id = ?", current_user.university_id)

INSERT INTO "universities" ("name", "created_at", "updated_at", "ug_books_limit", "grad_books_limit", "phd_books_limit") VALUES (?, ?, ?, ?, ?, ?)  [["name", "university2"], ["created_at", "2019-10-03 01:24:59.964848"], ["updated_at", "2019-10-03 01:24:59.964848"], ["ug_books_limit", 2], ["grad_books_limit", 3], ["phd_books_limit", 4]]
---
  def create
    @university = University.new(university_params)

    respond_to do |format|
      if @university.save

UPDATE "universities" SET "name" = ?, "updated_at" = ? WHERE "universities"."id" = ?  [["name", "UniversityNEW"], ["updated_at", "2019-10-03 05:04:55.393437"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @university.update(university_params)

DELETE FROM "universities" WHERE "universities"."id" = ?  [["id", 5]]
---
  def destroy
    @university.destroy

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_university
      @university = University.find(params[:id])