LibraryManagementSystem/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (id = 2)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user.usertype == "admin"
      @users = User.all
    else
      @users = User.where("id = ?", current_user.id)

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ?  [["university_id", 1]]
---
  def new
    @user = User.new
    @libraries = []
    if params[:university_id].present?
      @libraries = University.find(params[:university_id]).libraries

UPDATE "users" SET "encrypted_password" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$11$xR9/aQchiG4.35IgUd4RjOUtD8/MkLgunppTX682z05.qvVmUNWr6"], ["email", "l@gmail.com"], ["updated_at", "2019-10-03 06:05:15.041795"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_user
      if params[:id] != 'sign_out'
        @user = User.find(params[:id])