LibraryManagementSystem/app/views/lib_books/_form.html.erb

SELECT "books".* FROM "books"
SELECT "libraries".* FROM "libraries"
---
    <%= form.label :library_id %>
    <%= select("lib_book", "library_id", Library.all.collect{ |c| [ c.name, c.id] })  %>

SELECT "books".* FROM "books"
---
    <%= form.label :book_id %>
    <%= select("lib_book", "book_id", Book.all.collect{ |c| [ c.title, c.id] })  %>