LibraryManagementSystem/app/views/lib_books/index.html.erb

      <tr>
        <td><%= Library.find(lib_book.library_id).name %></td>
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]