LibraryManagementSystem/app/views/lib_books/show.html.erb

  <strong>Library:</strong>
  <%= Library.find(@lib_book.library_id).name %>
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  <strong>Book:</strong>
  <%= Book.find(@lib_book.book_id).title %>
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]