app/views/users/_form.html.erb

    <%= form.label :usertype %>
    <%= form.select :usertype, [['Librarian','librarian'], ['Student - Doctoral (PhD)','studentPhD'],['Student - Grad','studentG'],['Student - Undergrad','studentUG']], :prompt => 'Select One'%>
---
SELECT "usertypes".* FROM "usertypes" WHERE (id='admin')

    <%= form.label :Universities %>
    <%= select("user", "university_id", University.all.collect{ |c| [ c.name, c.id] })  %>
---
SELECT  "users".* FROM "users" WHERE (id) LIMIT ?  [["LIMIT", 1]]
SELECT "universities".* FROM "universities"