app/views/libraries/index.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ?  [["university_id", 2]]
---
  <tbody>
    <% @university.libraries.each do |library| %>