LibraryManagementSystem/app/views/devise/registrations/new.html.erb

SELECT "universities".* FROM "universities"
---
    <%= f.label :Universities %>
    <%= select("user", "university_id", University.all.collect{ |c| [ c.name, c.id] })  %>