LibraryManagementSystem/app/views/bookmarks/index.html.erb

SELECT  "lib_books".* FROM "lib_books" WHERE "lib_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= Book.find_by_id(LibBook.find_by_id(bookmark.lib_book_id).book_id).title %></td>