app/views/reservations/show.html.erb

SELECT  "lib_books".* FROM "lib_books" WHERE "lib_books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Title:</strong>
  <%= Book.find_by_id(@reservation.lib_book.book_id).title %>