app/views/lib_books/_form.html.erb

SELECT "books".* FROM "books"
---
    <%= form.label :book_id %>
    <%= select("lib_book", "book_id", Book.all.collect{ |c| [ c.title, c.id] })  %>