app/views/lib_books/index.html.erb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reservations" WHERE "reservations"."lib_book_id" = ? AND "reservations"."status" = ?  [["lib_book_id", 1], ["status", 2]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."lib_book_id" = ? ORDER BY "bookmarks"."id" ASC LIMIT ?  [["user_id", 1], ["lib_book_id", 1], ["LIMIT", 1]]
---
    <% @lib_books.each do |lib_book|
          @book = Book.find(lib_book.book_id)
          @available = lib_book.quantity - Reservation.where(:lib_book => lib_book.id).where(:status => 1).count()
          @bookmark = Bookmark.where(:user_id => current_user.id).where(:lib_book => lib_book.id).first()