app/views/lib_books/index.html.erb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
      <tr>
        <td><%= Library.find(lib_book.library_id).name %></td>