app/controllers/lib_books_controller.rb

SELECT "lib_books".* FROM "lib_books" WHERE "lib_books"."library_id" = ?  [["library_id", 4]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if params[:search]
      @lib_books = []
      @library.lib_books.each do |lib_book|
        @book = Book.find_by_id(lib_book.book_id)

INSERT INTO "lib_books" ("library_id", "book_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["library_id", 4], ["book_id", 1], ["quantity", 2], ["created_at", "2019-10-03 06:18:39.819354"], ["updated_at", "2019-10-03 06:18:39.819354"]]
---
  def create
    @lib_book = LibBook.new(lib_book_params)

    respond_to do |format|
      if @lib_book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_lib_book
      @lib_book = LibBook.find(params[:id])

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def get_library
      @library = Library.find(params[:library_id])

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def get_university
      @university = University.find(params[:university_id])

SELECT COUNT(*) FROM "reservations" WHERE "reservations"."user_id" = ? AND "reservations"."status" = ?  [["user_id", 1], ["status", 1]]
---
    def get_counts
      @book_limit = -1
      if current_user.usertype == 'studentUG'
        @book_limit = @university.ug_books_limit
      elsif current_user.usertype == 'studentG'
        @book_limit = @university.grad_books_limit
      elsif current_user.usertype == 'studentPhD'
        @book_limit = @university.phd_books_limit
      end
      @num_existing_reservations = Reservation.where(:user_id => current_user.id).where(:status => 1).count()