app/controllers/libraries_controller.rb

INSERT INTO "libraries" ("university_id", "location", "name", "max_days", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["university_id", 2], ["location", "123"], ["name", "Hunt"], ["max_days", 2], ["created_at", "2019-09-30 14:04:44.578281"], ["updated_at", "2019-09-30 14:04:44.578281"]]
---
  def create
    @library = Library.new(library_params)

    respond_to do |format|
      if @library.save

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_library
      @library = Library.find(params[:id])

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_university
      @university = University.find(params[:university_id])