app/controllers/reservations_controller.rb

SELECT "lib_books".* FROM "lib_books" WHERE "lib_books"."library_id" = ?  [["library_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."lib_book_id" = ?  [["lib_book_id", 1]]
---
  def index
    @reservations = []
    @library.lib_books.each do |lib_book|
      lib_book.reservations.each do |reservation|

INSERT INTO "reservations" ("lib_book_id", "user_id", "status", "checkoutstamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["lib_book_id", 1], ["user_id", 9], ["status", 1], ["checkoutstamp", "2019-10-03 06:19:38.503174"], ["created_at", "2019-10-03 06:19:38.509163"], ["updated_at", "2019-10-03 06:19:38.509163"]]
---
  def create
    @reservation = Reservation.new(reservation_params)
    if @reservation.status == 1
      @reservation.checkoutstamp = Time.now()
    elsif @reservation.status == 2
      @reservation.requeststamp = Time.now()
    elsif @reservation.status == 3
      @reservation.returnstamp = Time.now()
    end
    respond_to do |format|
      if @reservation.save

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_library
      @library = Library.find(params[:library_id])

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_university
      @university = University.find(params[:university_id])