app/controllers/universities_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user.usertype == "admin"
      @universities = []
      @list_all = University.all
      @list_all.each do |university|
        if !university.name.eql?"default"
          @universities.append(university)
        end
      end
    else
      @universities = University.where("id = ?", current_user.university_id)

INSERT INTO "universities" ("name", "created_at", "updated_at", "ug_books_limit", "grad_books_limit", "phd_books_limit") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["created_at", "2019-10-03 06:15:39.379798"], ["updated_at", "2019-10-03 06:15:39.379798"], ["ug_books_limit", 2], ["grad_books_limit", 2], ["phd_books_limit", 2]]
---
  def create
    @university = University.new(university_params)

    respond_to do |format|
      if @university.save

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_university
      @university = University.find(params[:id])