app/controllers/universities_controller.rb

SELECT "universities".* FROM "universities"
---
  def index
    @universities = University.all

INSERT INTO "universities" ("name", "created_at", "updated_at", "ug_books_limit", "grad_books_limit", "phd_books_limit") VALUES (?, ?, ?, ?, ?, ?)  [["name", "NCSU"], ["created_at", "2019-09-29 22:36:33.606325"], ["updated_at", "2019-09-29 22:36:33.606325"], ["ug_books_limit", 2], ["grad_books_limit", 3], ["phd_books_limit", 3]]
---
  def create
    @university = University.new(university_params)

    respond_to do |format|
      if @university.save

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_university
      @university = University.find(params[:id])