LibraryManagementSystem/app/views/layouts/application.html.erb

  <% if current_user %>
    <% @university = University.find(current_user.university_id) %>
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]