LibraryManagementSystem/app/views/users/_form.html.erb

    <%= form.label :Universities %>
    <%= select_tag :university_id, options_for_select(University.all.reject { |u| u.name == "default" }.collect{ |c| [ c.name , c.id] }, selected: params[:university_id]),
    prompt: "Select University", class: "form-control", :onchange => "myFunction();" %>
---
SELECT "universities".* FROM "universities"