LibraryManagementSystem/app/views/users/_form.html.erb

SELECT "universities".* FROM "universities"
SELECT "libraries".* FROM "libraries" WHERE "libraries"."university_id" = ?  [["university_id", 1]]
---
    <%  @all_libraries = {}
        University.all.each do |university|
          @all_libraries[university.id] = []
          university.libraries.each do |library|